cask_args appdir: '/Applications'

tap 'homebrew/services'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

brew 'wget'

# Virtualization & Containerization
cask 'virtualbox'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'docker-swarm'

# Git
brew 'git'
brew 'hub'
brew 'git-flow'

# Git Client
cask 'github-desktop'
cask 'tower'

# Emulated Terminal
cask 'iterm2'

# Shell
brew 'zsh'
brew 'zsh-completions'

# Package Managers
brew 'yarn'

# Web browsers
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'torbrowser'

# Text Editor
cask 'atom'
cask 'sublime-text'
cask 'textmate'
cask 'macvim'

# Mindfulness, Productivity & System apps
cask 'spectacle'
cask 'alfred'
cask 'bartender'
cask 'resolutionator'
cask 'flux'
cask 'dash'
cask 'clipmenu'
cask 'the-unarchiver'

# Communication
cask 'slack'
cask 'skype'
cask 'textual'
cask 'irssi'

# Password Manager
cask 'lastpass'
cask '1password'

# Cloud storage
cask 'google-drive'
cask 'dropbox'

# FTP
cask 'transmit'
cask 'filezilla'
cask 'cyberduck'

# Adobe Bundle
cask 'adobe-illustrator-cc'
cask 'adobe-indesign-cc'
cask 'adobe-photoshop-cc'
cask 'adobe-photoshop-lightroom'
cask 'adobe-bridge-cc'
cask 'adobe-creative-cloud'

# Sketch
cask 'sketch'
cask 'sketch-toolbox'

# Font Manager
cask 'skyfonts'
cask 'rightfont'

# IDE
cask 'webstorm'
cask 'intellij-idea'
cask 'coda'

# Hard disk Manager
cask 'daisydisk'

# Torrent
cask 'transmission'

# Fonts
cask 'font-menlo'
cask 'font-menlo-for-powerline'
cask 'font-montserrat'
cask 'font-raleway'
cask 'font-merriweather'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-inconsolata'
cask 'font-consolas-for-powerline'
cask 'font-hack'
cask 'font-source-code-pro'
